# Jour 2: 

## Introduction au différents libraries de python
* Introduction à l'apprentissage automatique
* Différence entre l'apprentissage supervisé et non supervisé
    * classification
    * Régression
* Introduction à la librairie numpy
* Introduction au bibliothèque Pandas ( création de data frame, series, lire des fichier, indexation, visualisation, etc)



*Par [Abdoulaye Balde](https://www.linkedin.com/in/abdoulayegk)*

# **Initiation au concept de Dataframe**

La dataframe est la principale structure de données de la librairie [Pandas](https://pypi.org/project/pandas/). Dans une dataframe, les données se présentent sous formes de tableau (lignes et colonnes). Plus précisement, dans une dataframe on parle d'observations (pour désigner les lignes) et de variables (pour désigner les colonnes).     
[Wes Mckinney](https://wesmckinney.com/), créateur de la librairie Pandas.

On peut créer une dataframe pandas à partir d'un dictionnaire :

1.   Importer la librairie pandas (*import pandas as pd*)
2.   Création du dictionnaire s'il n'existe pas encore
3.   Transformation du dictionnaire en dataframe :          
*df = pd.DataFrame(dictionnaire)*

***Exercice :***

Créer un dictionnaire pour stocker les notes par 4 élèves en Maths et Français. Transformez ce dictionnaire en Dataframe.        
Transposez la dataframe créée (lignes en colonnes puis colonnes en lignes) et renommez les colonnes.          
Ryan (18 , 16) ; Elisa (20 , 12), Martine (20, 20), Robert (14, 15). La première note est celle obtenue en Maths et la deuxième est pour le Français.

# Pandas Series
Une Series est un tableau unidimensionnel étiqueté capable de contenir n'importe quel type de données. Elle peut être considérée comme une colonne d'une feuille de calcul ou une seule dimension d'un tableau. Chaque élément d'une Series est associé à un indice ou une étiquette qui permet d'accéder facilement aux données.

In [1]:
# we first import series from pandas
from pandas import Series

In [2]:
# let's first creat a serie
mylist = [20, 20, 30, 40]

s = Series(mylist)
s

0    20
1    20
2    30
3    40
dtype: int64

In [3]:
# you can also et your own index because the default index start from 0 till n
ss = Series(
    [12, 13, 7, 80, 95], index=list("abcde")
)  # not we can use index=['a','b',..]
ss

a    12
b    13
c     7
d    80
e    95
dtype: int64

In [4]:
# you can also add element to your series. Let's say I want to add 200 in ss
ss["f"] = 200
ss

a     12
b     13
c      7
d     80
e     95
f    200
dtype: int64

In [5]:
# use can use comparaison operatiors on series
ss > 12


# # To make look nice and more readable this will return a series of integer
# ss[ss < 13]

a    False
b     True
c    False
d     True
e     True
f     True
dtype: bool

In [6]:
# What will be difference between the following two lines(list and array)

l = [12, 13, 7, 80, 95] * 2
print(l)
print("\n\n")

print(ss * 2)

[12, 13, 7, 80, 95, 12, 13, 7, 80, 95]



a     24
b     26
c     14
d    160
e    190
f    400
dtype: int64

In [2]:
# Création du dictionnaire notes

notes = {'Ryan':[18, 16], 
         'Elisa':[20, 12], 
         'Martine':[20, 20], 
         'Robert':[14, 15]}
notes

{'Ryan': [18, 16], 'Elisa': [20, 12], 'Martine': [20, 20], 'Robert': [14, 15]}

In [3]:
# Transformation du dictionnaire notes en dataframe
import pandas as pd
df = pd.DataFrame(notes)
df

   Ryan  Elisa  Martine  Robert
0    18     20       20      14
1    16     12       20      15

In [4]:
# Transposition de la dataframe df
df = df.T
df

          0   1
Ryan     18  16
Elisa    20  12
Martine  20  20
Robert   14  15

In [5]:
# Renommer les colonnes
df.columns = ['Maths', 'Français']
df

         Maths  Français
Ryan        18        16
Elisa       20        12
Martine     20        20
Robert      14        15

In [6]:
# Indexes de df
df.index

Index(['Ryan', 'Elisa', 'Martine', 'Robert'], dtype='object')

Cette petite section sur les dataframes Pandas est une introduction à Pandas. Pandas et Numpy sont des librairies fondamentales en Data Science. Il y aura donc deux grandes sections consacrées exclusivement à ces deux librairies.

In [8]:
# ajouter une column pysique
df['Physique'] = [19, 12, 14,17]
df

         Maths  Français  Physique
Ryan        18        16        19
Elisa       20        12        12
Martine     20        20        14
Robert      14        15        17

## trouver la moyenne et la somme de df

In [11]:
df.sum()/len(df)

Maths       18.00
Français    15.75
Physique    15.50
dtype: float64

## Exo: ajouter une column Chimie ou la note pour Robert dans cette matiere n'existe pas

# Loc and Iloc

* Loc: utliser pour acceder au ligne de la dataframe, ici, on utilise le nom de la column
* iloc: utilise pour faire la meme chose mais ici on utilise l'index au lieu de la colomn

In [18]:
df.iloc[0:3]

         Maths  Français  Physique
Ryan        18        16        19
Elisa       20        12        12
Martine     20        20        14

In [42]:
df.iloc[[1,3]]

        Maths  Français  Physique
Elisa      20        12        12
Robert     14        15        17

In [23]:
df.loc['Martine']['Physique']

14

In [38]:
df.sample(3, random_state=42)

        Maths  Français  Physique
Elisa      20        12        12
Robert     14        15        17
Ryan       18        16        19

**Note:** on utilse random state pour que le resulat soit reptitif a chaque fois qu'on execute de code.

In [41]:
df.sample(3)

         Maths  Français  Physique
Martine     20        20        14
Ryan        18        16        19
Elisa       20        12        12